# Пароль минимум 12 символов, 1 большая буква, одна маленькая, один спецсимвол:

import re

print("Пароль должен состоять не менее, чем из 12 символов, из них минимум одна заглавная буква, минимум одна малеькая и один спецсимвол (?!/@)"")")
while True:
    user_password = input("Введіть пароль: ")

    # Перевірка довжини паролю
    if len(user_password) < 12:
        print("Пароль НЕ є безпечним. Занадто короткий.")
        continue

    # Перевірка наявності літер верхнього та нижнього регістрів
    if not re.search("[A-Z]", user_password) or not re.search("[a-z]", user_password):
        print("Пароль НЕ є безпечним. Не вистачає літер верхнього або нижнього регістрів.")
        continue

    # Перевірка наявності цифри
    if not re.search("[0-9]", user_password):
        print("Пароль НЕ є безпечним. Не вистачає цифр.")
        continue

    # Перевірка наявності спецсимволу (?/!@)
    if not re.search("[?!@]", user_password):
        print("Пароль НЕ є безпечним. Не вистачає спецсимволів (?/!@).")
        continue

    print("Пароль є безпечним")
    break